{
  "books": [
    {
      "id": 1,
      "imgUrl": "https://akniga.org/uploads/media/topic/2020/06/28/16/preview/69e87e3223491fec6b50_400x.jpg",
      "title": "Маскарад убийцы",
      "descr": "Ночью в дом Уолтера Джаллина проникли двое вооруженных людей — грабитель и преследующий его полицейский. Но и он не безоружен. Вот только патрон один и нужно правильно выбрать цель.",
      "genre": "реализм",
      "authorId": 1
    },
    {
      "id": 2,
      "imgUrl": "https://akniga.org/uploads/media/topic/2020/06/25/14/preview/cc51e6e00e4b07c43095_400x.jpg",
      "title": "Лавка миров",
      "descr": "Мистер Уэйн дошёл до магазина миров. В разговоре с продавцом он узнал, ЧТО он может получить в обмен на всё своё состояние — на свёрток, который он принёс с собой. Продавец предлагал Уэйну при помощи укола освободить его сознание, чтобы тот смог выбрать для себя один из бесчисленного множества миров, которые Земля порождает непрерывно — мир своей мечты…",
      "genre": "фантакстика",
      "authorId": 1
    },
    {
      "id": 3,
      "imgUrl": "https://akniga.org/uploads/media/topic/2020/06/23/15/preview/afb8c37c8c6117e24274_400x.jpg",
      "title": "Право на смерть",
      "descr": "Он погиб на поле боя и его воскресили, чтобы отправить назад на передовую. Это было уже не в первый раз. Снова боль, которую не заглушала даже анестезия. Так жить дальше было нельзя, но у него не было и права на смерть…",
      "genre": "фантакстика",
      "authorId": 1
    },
    {
      "id": 4,
      "imgUrl": "https://akniga.org/uploads/media/topic/2020/06/28/15/preview/f76d05c44e989770888f_400x.jpg",
      "title": "Норман Уиздом и ангел смерти",
      "descr": "Стэнли Моррисон, обычный, возможно даже лучший Больничный Помощник очень не любит, когда кто-нибудь не знает Нормана Уиздома, Маленького Человека, Завоевавшего Все Наши Сердца.",
      "genre": "триллер",
      "authorId": 2
    },
    {
      "id": 5,
      "imgUrl": "https://akniga.org/uploads/media/topic/2019/03/22/09/preview/4d7fe3fda225b9021558_400x.jpg",
      "title": "Руна",
      "descr": "«Руна», одно из наиболее популярных произведений британского мастера криминально-мистической литературы ужасов Кристофера Фаулера. Творческую манеру писателя различают актуальность темы, уверительность создаваемых образов, а также оригинальность и острота сюжетов, в которых сочетаются элементы напряженности детективно-мистического сюжета и едкой социальной сатиры.",
      "genre": "мистика",
      "authorId": 2
    },
    {
      "id": 6,
      "imgUrl": "https://akniga.org/uploads/media/topic/2020/05/17/16/preview/4ce36fcf26e3be50c3d2_400x.jpg",
      "title": "Хребты безумия",
      "descr": "Полярная экспедиция сталкивается с запредельным ужасом древних веков. Лучшее кошмарно-прекрасно-завораживающее описание в творчестве Лавкрафта запечатлено именно в этом произведении. Это описание заброшенного ледяного города «древних», уводящего в недра земли.",
      "genre": "мистика",
      "authorId": 3
    },
    {
      "id": 7,
      "imgUrl": "https://akniga.org/uploads/media/topic/2019/12/15/15/preview/977b0071402b5f013bc6_400x.jpg",
      "title": "Курган",
      "descr": "В 1928 году любознательный этнограф прибыл в Оклахому, чтобы провести сравнительный анализ историй о призраках, бытующих там, с уже известными подобными историями. Оказалось, что все истории связанны в основном с единичным курганом, расположившемся на западе штата.",
      "genre": "мистика",
      "authorId": 3
    },
    {
      "id": 8,
      "imgUrl": "https://akniga.org/uploads/media/topic/2019/03/30/21/preview/9678510160fc2d2ebe60_400x.jpg",
      "title": "Дагон",
      "descr": "Попав в плен во время войны, герой рассказа совершает побег и оказывается в открытом океане на шлюпке. После изматывающих и бесконечных дней поиска суши, проснувшись в очередной раз, он обнаруживает, что тонет в вязком черном болоте среди разложившихся останков рыб и прочей мерзости…",
      "genre": "ужасы",
      "authorId": 3
    },
    {
      "id": 9,
      "imgUrl": "https://book-ye.com.ua/upload/iblock/8ce/94a4977d_fa70_11eb_8150_0050568ef5e6_14183b63_fa71_11eb_8150_0050568ef5e6.jpg",
      "title": "Борислав сміється",
      "descr": "«Борислав сміється» — один із найвидатніших творів Івана Франка, у якому письменник засуджує експлуататорський лад, показує, як зароджуються нові, революційні форми життя, змальовує позитивний образ кадрового робітника. Художність у творі виявлена у розкритті письменником глибокої краси, духовного багатства простих людей, їх непримиренність до суспільної неправди. Повість присвячена опису страйку на нафтовому промислі в місті Борислав. На її написання письменника надихнули справжні події. Повість Івана Франка «Борислав сміється» друкувалася частинами у львівському журналі «Світ» у 1881– 1882 роках. Коли «Світ» перестав виходити, урвалася й повість, яка так і залишилася незавершеною. У представленому виданні, що вийшло друком у 1934 році, окрім оригінального тексту, подано закінчення, написане Петром Франком (син письменника).",
      "genre": "українська класика",
      "authorId": 4
    },
    {
      "id": 10,
      "imgUrl": "https://book-ye.com.ua/upload/iblock/28d/cfa0524a_74e0_11e6_80be_000c29ae1566_089022fe_2528_11e7_80c5_000c29ae1566.png",
      "title": "Boa constrictor. Бориславські оповідання",
      "descr": "У цьому виданні зібрані всі прозові твори Івана Франка, написані ним на бориславську тематику, які переконливо засвідчують не тільки жорстоку експлуатацію нашої землі різними зайдами та неймовірний визиск робітників, але й є наочним прикладом зміни поглядів письменника на робітниче питання. Видання проілюстровано творами відомого українського художника Петра Марковича з нагоди його 80-річчя. Присвячується видання пам'яті одного з найвідоміших франкознавців Іванові Денисюку.",
      "genre": "українська класика",
      "authorId": 4
    },
    {
      "id": 11,
      "imgUrl": "https://book-ye.com.ua/upload/iblock/3b0/205e8a50_2854_11e9_8112_000c29ae1566_ae6d3068_d2bf_11ec_816f_0050568ef5e6.jpg",
      "title": "Терен у нозі. Гуцульська проза",
      "descr": "Іван Франко (1856–1916) вперше відвідав Гуцульщину 24-річним парубком і відтоді приїжджав сюди впродовж життя. Його найбільше захопила Криворівня, де письменник приятелював з місцевим парохом Олексою Волянським. У Буркуті зустрічався з Лесею Українкою, коли вона приїжджала на лікування цілющою водою. А ще відвідував Довгопілля, Голови, Косів, Берегомет, Кути… Хоч навряд чи обмежився лише цими гуцульськими локаціями. Окрім приємних занять ловлі форелі чи збирання грибів і афин, Франко дуже любив спілкуватися з гуцулами. Він вихоплював з тих розмов коштовні історії і одягав їх в діамант літератури. Так письменник створив оповідання «Гуцульський король», «Терен у нозі» та «Як Юра Шикманюк брів Черемош», які подаємо в книжці. Гуцульщина вабила Івана Франка ще зі студентських років. В одній з перших повістей «Петрії й Довбущуки», він інтерпретує історію Олекси Довбуша. Вже у зрілому віці Франко зредагував її, виправивши «хиби тої в молодих літах писаної повісті». Повість також знайдете у цьому виданні.",
      "genre": "українська класика",
      "authorId": 4
    },
    {
      "id": 12,
      "imgUrl": "http://www.apriori.lviv.ua/wp-content/uploads/2022/06/2022_Zakhar-Berkut_mokap.jpg",
      "title": "Захар Беркут",
      "descr": "Було се 1241 року. За сивої давнини, коли ще люди були інакші, а земля — могутніша. І жив у той час славний ватажок вільних тухольців — мудрий Захар Беркут. Але там, де є герої, завжди з’являються поганці. Боярин Тугар Вовк прагнув влади над непокірними тухольцями. А отримавши відсіч, виплекав у своєму чорному серці помсту. На табір вирушає численне монгольське військо, за намовленням зрадника Тугара. А молодий син Захара Беркута Максим опиняється у ворожому полоні… Наближається битва. Мечі тухольців — гострі, а щити — міцні. Та ще міцніші їхні серця, в яких живе свобода. Ворог прийшов знищити їх. Але свобода незнищенна",
      "genre": "українська класика",
      "authorId": 4
    }
  ],
  "authors": [
    {
      "id": 1,
      "name": "Роберт Шекли"
    },
    {
      "id": 2,
      "name": "Кристофер Фаулер"
    },
    {
      "id": 3,
      "name": "Говард Лавкрафт"
    },
    {
      "id": 4,
      "name": "Іван Франко"
    }
  ]
}
